OpenFOAM/foam9tutorials/CFD/flameExtinction/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.233;

boundaryField
{
    burner
    {
        type                totalFlowRateAdvectiveDiffusive;
        massFluxFraction    0.0;
        phi                 phi;
        rho                 rho;
        value               uniform 0.0;
    }

    coflow
    {
       type            uniformFixedValue;
       uniformValue    table
        (
            (0	0.233)
            (1	0.233)
            (2	0.233)
            (3	0.233)
            (4	0.233)
            (5	0.228)
            (6	0.223)
            (7	0.218)
            (8	0.213)
            (9	0.208)
            (10	0.203)
            (11	0.198)
            (12	0.193)
            (13	0.188)
            (14	0.183)
            (15	0.178)
            (16	0.173)
            (17	0.168)
            (18	0.163)
            (19	0.158)
            (20	0.153)
            (21	0.148)
            (22	0.143)
            (23	0.138)
            (24	0.133)
            (25	0.128)
            (26	0.123)
            (27	0.118)
            (28	0.113)
            (29	0.108)
            (30	0.103)
            (31	0.098)
            (32	0.093)
            (33	0.088)
            (34	0.083)
            (35	0.078)
            (36	0.073)
            (37	0.068)
            (38	0.063)
            (39	0.058)
            (40	0.053)
        ); 
        value           uniform 0;
    }

    blockage
    {
        type            fixedValue;
        value           $internalField;
    }

    open
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}

// ************************************************************************* //
